Revit 2025 API
ImporterIFC.HybridCreateImportMap Method
Note: This API is now obsolete.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2025 and may be removed in a later version of Revit. We suggest you use the 'IFCHybridImport' class instead.")]
public IDictionary<string, ElementId> HybridCreateImportMap(
	Document doc,
	IList<ElementId> elementIds
)
<ObsoleteAttribute("This method is deprecated in Revit 2025 and may be removed in a later version of Revit. We suggest you use the 'IFCHybridImport' class instead.")>
Public Function HybridCreateImportMap (
	doc As Document,
	elementIds As IList(Of ElementId)
) As IDictionary(Of String, ElementId)
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2025 and may be removed in a later version of Revit. We suggest you use the 'IFCHybridImport' class instead.")]
IDictionary<String^, ElementId^>^ HybridCreateImportMap(
	Document^ doc,
	IList<ElementId^>^ elementIds
)
[<ObsoleteAttribute("This method is deprecated in Revit 2025 and may be removed in a later version of Revit. We suggest you use the 'IFCHybridImport' class instead.")>]
member HybridCreateImportMap :
        doc : Document *
        elementIds : IList<ElementId> -> IDictionary<string, ElementId>
Parameters
doc Document
elementIds IList<ElementId>
Return Value
IDictionary<String, ElementId>
See Also
Reference
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace